<a href="https://colab.research.google.com/github/cabralana/training_python_with_sql/blob/main/3.Training_Python_with_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

###**SQL - Revisão de Conhecimentos**

Eu tive como base, neste estudo, a orientação do Odemir Depieri e Ronisson Lucas da equipe @DataViking

Fui elaborando o passo a passo do material deles, para que, assim, pudesse fixar melhor as instruções SQL. 
Mudei algumas instruções para melhor fixação.

### IMPORTAR **SQL** NO GOOGLE COLAB

In [ ]:
import sqlite3

In [ ]:
#Python Version
from platform import python_version

print(python_version())

3.7.15

#Criação BD

In [ ]:
Conexao = sqlite3.connect('Banco_Dados')

#Apontar para o BD

In [ ]:
Cursor = Conexao.cursor()

###CRIAR TABELA **(CREATE TABLE)**

CREATE TABLE table_name(column1 datatype, column2 datatype, column3 datatype, ...)

In [ ]:
Cursor.execute(
    'CREATE TABLE Minha_Primeira_Tabela (Nome text, Data text, Idade real)'
)
Conexao.commit()

###INSERIR REGISTROS NA TABELA **(INSERT INTO)**

INSERT INTO table_name(column1, column2, column3, ...)

In [ ]:
Cursor.execute('INSERT INTO Minha_Primeira_Tabela VALUES ("Ana Paula", "30/09/1993", "29")')

In [ ]:
Cursor.execute('INSERT INTO Minha_Primeira_Tabela VALUES ("Priscila", "26/11/1992", "30")')

In [ ]:
#Importando números aleatórios
import random

In [ ]:

for Loop in range(10):
  

  Numero = random.randint(10, 20)
 
  Cursor.execute( f' INSERT INTO Minha_Primeira_Tabela VALUES ( "26/11/1992", "Priscila", {Numero} ) ')

###SELECIONAR DADOS EM UM BD **(SELECT)**

In [ ]:
#Consulta com SELECT * - todos os registros da tabela
Consulta = Cursor.execute('SELECT * FROM Minha_Primeira_Tabela').fetchall()
print (Consulta)

[('Ana Paula', '30/09/1993', 29.0), ('Priscila', '26/11/1992', 30.0), ('26/11/1992', 'Priscila', 13.0), ('26/11/1992', 'Priscila', 20.0), ('26/11/1992', 'Priscila', 14.0), ('26/11/1992', 'Priscila', 14.0), ('26/11/1992', 'Priscila', 18.0), ('26/11/1992', 'Priscila', 19.0), ('26/11/1992', 'Priscila', 13.0), ('26/11/1992', 'Priscila', 20.0), ('26/11/1992', 'Priscila', 19.0), ('26/11/1992', 'Priscila', 11.0)]

In [ ]:
#Consulta com SELECT columns1, columns2, columns3... - registros específicos
Consulta = Cursor.execute('SELECT Nome, Data, Idade FROM Minha_Primeira_Tabela').fetchall()

for Linha in Consulta: 
  print(Linha)

('Ana Paula', '30/09/1993', 29.0)
('Priscila', '26/11/1992', 30.0)
('26/11/1992', 'Priscila', 13.0)
('26/11/1992', 'Priscila', 20.0)
('26/11/1992', 'Priscila', 14.0)
('26/11/1992', 'Priscila', 14.0)
('26/11/1992', 'Priscila', 18.0)
('26/11/1992', 'Priscila', 19.0)
('26/11/1992', 'Priscila', 13.0)
('26/11/1992', 'Priscila', 20.0)
('26/11/1992', 'Priscila', 19.0)
('26/11/1992', 'Priscila', 11.0)

###FILTRAR REGISTROS **(WHERE)**

SELECT column1 FROM table_name WHERE condition;

In [ ]:
Consulta = Cursor.execute(
    '''
    SELECT * FROM Minha_Primeira_Tabela
    WHERE Idade = '29'
    '''
).fetchall()
print(Consulta)

[('Ana Paula', '30/09/1993', 29.0)]

In [ ]:
Consulta = Cursor.execute(
    '''
    SELECT * FROM Minha_Primeira_Tabela 
    WHERE Idade > 23
    '''
).fetchall()

print(Consulta)

[('Ana Paula', '30/09/1993', 29.0), ('Priscila', '26/11/1992', 30.0)]

In [ ]:
Consulta = Cursor.execute(
    '''
    SELECT * FROM Minha_Primeira_Tabela 
    WHERE Idade < 23
    '''
).fetchall()

print(Consulta)

[('26/11/1992', 'Priscila', 13.0), ('26/11/1992', 'Priscila', 20.0), ('26/11/1992', 'Priscila', 14.0), ('26/11/1992', 'Priscila', 14.0), ('26/11/1992', 'Priscila', 18.0), ('26/11/1992', 'Priscila', 19.0), ('26/11/1992', 'Priscila', 13.0), ('26/11/1992', 'Priscila', 20.0), ('26/11/1992', 'Priscila', 19.0), ('26/11/1992', 'Priscila', 11.0)]

In [ ]:
Consulta = Cursor.execute(
    '''
    SELECT * FROM Minha_Primeira_Tabela 
    WHERE Idade <= 23
    '''
).fetchall()

print(Consulta)

[('26/11/1992', 'Priscila', 13.0), ('26/11/1992', 'Priscila', 20.0), ('26/11/1992', 'Priscila', 14.0), ('26/11/1992', 'Priscila', 14.0), ('26/11/1992', 'Priscila', 18.0), ('26/11/1992', 'Priscila', 19.0), ('26/11/1992', 'Priscila', 13.0), ('26/11/1992', 'Priscila', 20.0), ('26/11/1992', 'Priscila', 19.0), ('26/11/1992', 'Priscila', 11.0)]

In [ ]:
Consulta = Cursor.execute(
    '''
    SELECT * FROM Minha_Primeira_Tabela 
    WHERE Nome <> 'Ana Paula'
    '''
).fetchall()

for Linha in Consulta:
  print( Linha )

('Priscila', '26/11/1992', 30.0)
('26/11/1992', 'Priscila', 13.0)
('26/11/1992', 'Priscila', 20.0)
('26/11/1992', 'Priscila', 14.0)
('26/11/1992', 'Priscila', 14.0)
('26/11/1992', 'Priscila', 18.0)
('26/11/1992', 'Priscila', 19.0)
('26/11/1992', 'Priscila', 13.0)
('26/11/1992', 'Priscila', 20.0)
('26/11/1992', 'Priscila', 19.0)
('26/11/1992', 'Priscila', 11.0)

###SELECIONAR DETERMINADO RANGE DE REGISTROS EM UMA TABELA **(BETWEEN)**

In [ ]:
Consulta = Cursor.execute(
    '''
    SELECT * FROM Minha_Primeira_Tabela
    WHERE Idade BETWEEN 20 AND 30
    '''
).fetchall()

for Linha in Consulta:
  print ( Linha )

('Ana Paula', '30/09/1993', 29.0)
('Priscila', '26/11/1992', 30.0)
('26/11/1992', 'Priscila', 20.0)
('26/11/1992', 'Priscila', 20.0)

###PARA PROCURAR UM PADRÃO ESPECÍFICO EM UMA COLUNA, USA-SE O **(LIKE)** EM UMA WHERE 




*   % - representa zero, um ou vários caracteres
*   _ - um único caractere

In [ ]:
Consulta = Cursor.execute(
  '''
  SELECT * FROM Minha_Primeira_Tabela
  WHERE Nome LIKE 'A%' 
  '''
).fetchall()

for Linha in Consulta:
  print(Linha)

  #que comece com a letra A

('Ana Paula', '30/09/1993', 29.0)

In [ ]:
Consulta = Cursor.execute(
  '''
  SELECT * FROM Minha_Primeira_Tabela
  WHERE Nome LIKE '%A' 
  '''
).fetchall()

for Linha in Consulta:
  print(Linha)

  #que termine com a letra A

('Ana Paula', '30/09/1993', 29.0)
('Priscila', '26/11/1992', 30.0)

In [ ]:
Consulta = Cursor.execute(
  '''
  SELECT * FROM Minha_Primeira_Tabela
  WHERE Nome LIKE '%scil%' 
  '''
).fetchall()

for Linha in Consulta:
  print(Linha)

  #que tenha o padrão

('Priscila', '26/11/1992', 30.0)

###PERMITE ESPECIFICAR VÁRIOS VALORES EM UMA WHERE **(IN)**

In [ ]:
Consulta = Cursor.execute(
    '''
    SELECT * FROM Minha_Primeira_Tabela
    WHERE Idade IN (15,18,21,24,27,30)
    '''
).fetchall()

for Linha in Consulta:
  print(Linha)

('Priscila', '26/11/1992', 30.0)
('26/11/1992', 'Priscila', 18.0)

In [ ]:
Consulta = Cursor.execute(
    '''
    SELECT * FROM Minha_Primeira_Tabela
    WHERE Nome IN ("Ana Paula")
    '''
).fetchall()

for Linha in Consulta:
  print(Linha)

('Ana Paula', '30/09/1993', 29.0)

###OS OPERAODRES **AND, OR e NOT** PODEM SER COMBINADOS COM A CLÁUSULA WHERE 

1. AND - operador exibe registro se todas as condições separadas por AND for TRUE
2. OR - exibe um registro se alguma das condições separadas for TRUE
3. NOT - exibe registro se a(s) condição(s) não for verdadeira.

In [ ]:
Consulta = Cursor.execute(
    ''' 
    SELECT * FROM Minha_Primeira_Tabela
    WHERE Idade = 29  AND Nome = 'Ana Paula'
    '''
).fetchall()

print( Consulta )

[('Ana Paula', '30/09/1993', 29.0)]

In [ ]:
Consulta = Cursor.execute(
    ''' 
    SELECT * FROM Minha_Primeira_Tabela
    WHERE Idade = 29 OR Nome = 'Priscila'
    '''
).fetchall()

print( Consulta )

[('Ana Paula', '30/09/1993', 29.0), ('Priscila', '26/11/1992', 30.0)]

In [ ]:
Consulta = Cursor.execute(
    ''' 
    SELECT * FROM Minha_Primeira_Tabela
    WHERE NOT Nome = 'Ana Paula'
    '''
).fetchall()

print( Consulta )

[('Priscila', '26/11/1992', 30.0), ('26/11/1992', 'Priscila', 13.0), ('26/11/1992', 'Priscila', 20.0), ('26/11/1992', 'Priscila', 14.0), ('26/11/1992', 'Priscila', 14.0), ('26/11/1992', 'Priscila', 18.0), ('26/11/1992', 'Priscila', 19.0), ('26/11/1992', 'Priscila', 13.0), ('26/11/1992', 'Priscila', 20.0), ('26/11/1992', 'Priscila', 19.0), ('26/11/1992', 'Priscila', 11.0)]

In [ ]:
Consulta = Cursor.execute(
    ''' 
    SELECT * FROM Minha_Primeira_Tabela
    WHERE Nome = 'Ana Paula' AND ( Idade > 25 OR Idade < 30 ) AND NOT Idade = 25
    '''
).fetchall()

print( Consulta )

[('Ana Paula', '30/09/1993', 29.0)]

##CLASSIFICAR O CONJUNTO DE RESULTADOS EM ORDEM CRESCENTE OU DESCRESCENTE (DESC) **(ORDER BY)**

In [ ]:
Consulta = Cursor.execute(
    ''' 
    SELECT * FROM Minha_Primeira_Tabela
    ORDER BY Idade, Nome
    '''
).fetchall()

for Linha in Consulta:
  print( Linha )

('26/11/1992', 'Priscila', 11.0)
('26/11/1992', 'Priscila', 13.0)
('26/11/1992', 'Priscila', 13.0)
('26/11/1992', 'Priscila', 14.0)
('26/11/1992', 'Priscila', 14.0)
('26/11/1992', 'Priscila', 18.0)
('26/11/1992', 'Priscila', 19.0)
('26/11/1992', 'Priscila', 19.0)
('26/11/1992', 'Priscila', 20.0)
('26/11/1992', 'Priscila', 20.0)
('Ana Paula', '30/09/1993', 29.0)
('Priscila', '26/11/1992', 30.0)

In [ ]:
Consulta = Cursor.execute(
    ''' 
    SELECT * FROM Minha_Primeira_Tabela
    ORDER BY Idade DESC
    '''
).fetchall()

for Linha in Consulta:
  print( Linha )

('Priscila', '26/11/1992', 30.0)
('Ana Paula', '30/09/1993', 29.0)
('26/11/1992', 'Priscila', 20.0)
('26/11/1992', 'Priscila', 20.0)
('26/11/1992', 'Priscila', 19.0)
('26/11/1992', 'Priscila', 19.0)
('26/11/1992', 'Priscila', 18.0)
('26/11/1992', 'Priscila', 14.0)
('26/11/1992', 'Priscila', 14.0)
('26/11/1992', 'Priscila', 13.0)
('26/11/1992', 'Priscila', 13.0)
('26/11/1992', 'Priscila', 11.0)

##VALORES NULOS - CAMPOS NULOS - **(NULL)** 

OBS: NÃO é possível testar valores **NULL** com operadores de comparação, como = < ou > 

OPERADORES USADOS:
* IS NULL 
* IS NOT NULL

In [ ]:
Cursor.execute('INSERT INTO Minha_Primeira_Tabela VALUES ("ABC", null, 30 ) ')
Cursor.execute('INSERT INTO Minha_Primeira_Tabela VALUES ("ABC", null, null ) ')

In [ ]:
Consulta = Cursor.execute(
    ''' 
    SELECT * FROM Minha_Primeira_Tabela
    WHERE Nome IS NULL
    '''
).fetchall()

print( Consulta )

#verifica os valores NULOS

[]

In [ ]:
Consulta = Cursor.execute(
    ''' 
    SELECT * FROM Minha_Primeira_Tabela
    WHERE Nome IS NOT NULL
    '''
).fetchall()

print( Consulta )

#verifica os valores NÃO NULOS

[('Ana Paula', '30/09/1993', 29.0), ('Priscila', '26/11/1992', 30.0), ('26/11/1992', 'Priscila', 13.0), ('26/11/1992', 'Priscila', 20.0), ('26/11/1992', 'Priscila', 14.0), ('26/11/1992', 'Priscila', 14.0), ('26/11/1992', 'Priscila', 18.0), ('26/11/1992', 'Priscila', 19.0), ('26/11/1992', 'Priscila', 13.0), ('26/11/1992', 'Priscila', 20.0), ('26/11/1992', 'Priscila', 19.0), ('26/11/1992', 'Priscila', 11.0), ('ABC', None, 30.0), ('ABC', None, None)]

##MODIFICAR REGISTROS EXISTENTES NA TABELA **(UPDATE)**

In [ ]:
Consulta = Cursor.execute(
    ''' 
    SELECT * FROM Minha_Primeira_Tabela
    '''
).fetchall()

for Linha in Consulta:
  print( Linha )

  #verificando valores não nulos

('Ana Paula', '30/09/1993', 29.0)
('Priscila', '26/11/1992', 30.0)
('26/11/1992', 'Priscila', 13.0)
('26/11/1992', 'Priscila', 20.0)
('26/11/1992', 'Priscila', 14.0)
('26/11/1992', 'Priscila', 14.0)
('26/11/1992', 'Priscila', 18.0)
('26/11/1992', 'Priscila', 19.0)
('26/11/1992', 'Priscila', 13.0)
('26/11/1992', 'Priscila', 20.0)
('26/11/1992', 'Priscila', 19.0)
('26/11/1992', 'Priscila', 11.0)
('ABC', None, 30.0)
('ABC', None, None)

In [ ]:
# Verificando valores não nulos
Consulta = Cursor.execute(
    ''' 
    UPDATE Minha_Primeira_Tabela
    SET Nome = 'Preenchido'
    WHERE Nome IS NULL
    '''
).fetchall()

print(Consulta)

[]

In [ ]:
print( Consulta )

[]

In [ ]:
# Verificando
Consulta = Cursor.execute(
    ''' 
    SELECT * FROM Minha_Primeira_Tabela
    '''
).fetchall()

for Linha in Consulta:
  print( Linha )

('Ana Paula', '30/09/1993', 29.0)
('Priscila', '26/11/1992', 30.0)
('26/11/1992', 'Priscila', 13.0)
('26/11/1992', 'Priscila', 20.0)
('26/11/1992', 'Priscila', 14.0)
('26/11/1992', 'Priscila', 14.0)
('26/11/1992', 'Priscila', 18.0)
('26/11/1992', 'Priscila', 19.0)
('26/11/1992', 'Priscila', 13.0)
('26/11/1992', 'Priscila', 20.0)
('26/11/1992', 'Priscila', 19.0)
('26/11/1992', 'Priscila', 11.0)
('ABC', None, 30.0)
('ABC', None, None)

In [ ]:
# Verificando valores não nulos
Consulta = Cursor.execute(
    ''' 
    UPDATE Minha_Primeira_Tabela
    SET Idade = 29
    WHERE Idade IS NULL
    '''
).fetchall()

# Verificando
Consulta = Cursor.execute(
    ''' 
    SELECT * FROM Minha_Primeira_Tabela
    '''
).fetchall()

for Linha in Consulta:
  print( Linha )

('Ana Paula', '30/09/1993', 29.0)
('Priscila', '26/11/1992', 30.0)
('26/11/1992', 'Priscila', 13.0)
('26/11/1992', 'Priscila', 20.0)
('26/11/1992', 'Priscila', 14.0)
('26/11/1992', 'Priscila', 14.0)
('26/11/1992', 'Priscila', 18.0)
('26/11/1992', 'Priscila', 19.0)
('26/11/1992', 'Priscila', 13.0)
('26/11/1992', 'Priscila', 20.0)
('26/11/1992', 'Priscila', 19.0)
('26/11/1992', 'Priscila', 11.0)
('ABC', None, 30.0)
('ABC', None, 29.0)

##EXCLUIR REGISTROS EXISTENTES EM UMA TABELA **(DELETE)**

In [ ]:
#Valores não nulos 
Consulta = Cursor.execute(
  '''
  DELETE from Minha_Primeira_Tabela 
  WHERE Nome = 'Preenchido' 
  '''
).fetchall

In [ ]:
Consulta = Cursor.execute(
    '''
    SELECT * from Minha_Primeira_Tabela
    '''
).fetchall()

for Linha in Consulta:
  print (Linha)

('Ana Paula', '30/09/1993', 29.0)
('Priscila', '26/11/1992', 30.0)
('26/11/1992', 'Priscila', 13.0)
('26/11/1992', 'Priscila', 20.0)
('26/11/1992', 'Priscila', 14.0)
('26/11/1992', 'Priscila', 14.0)
('26/11/1992', 'Priscila', 18.0)
('26/11/1992', 'Priscila', 19.0)
('26/11/1992', 'Priscila', 13.0)
('26/11/1992', 'Priscila', 20.0)
('26/11/1992', 'Priscila', 19.0)
('26/11/1992', 'Priscila', 11.0)
('ABC', None, 30.0)
('ABC', None, 29.0)

In [ ]:
#Valores não nulos
Consulta = Cursor.execute(
    '''
    DELETE from Minha_Primeira_Tabela
    WHERE Nome = 'Ana Paula' AND idade = 29
    '''
).fetchall()

In [ ]:
Consulta = Cursor.execute(
    ''' 
    SELECT * FROM Minha_Primeira_Tabela
    '''
).fetchall()

for Linha in Consulta:
  print( Linha )

('Priscila', '26/11/1992', 30.0)
('26/11/1992', 'Priscila', 13.0)
('26/11/1992', 'Priscila', 20.0)
('26/11/1992', 'Priscila', 14.0)
('26/11/1992', 'Priscila', 14.0)
('26/11/1992', 'Priscila', 18.0)
('26/11/1992', 'Priscila', 19.0)
('26/11/1992', 'Priscila', 13.0)
('26/11/1992', 'Priscila', 20.0)
('26/11/1992', 'Priscila', 19.0)
('26/11/1992', 'Priscila', 11.0)
('ABC', None, 30.0)
('ABC', None, 29.0)

##ESPECIFICAR O NÚMERO DE REGISTROS A SEREM RETORNADOS **(SELECT TOP)**

In [ ]:
Consulta = Cursor.execute(
    ''' 
    SELECT * FROM Minha_Primeira_Tabela
    LIMIT 5
    '''
).fetchall()

print( Consulta )

[('Priscila', '26/11/1992', 30.0), ('26/11/1992', 'Priscila', 13.0), ('26/11/1992', 'Priscila', 20.0), ('26/11/1992', 'Priscila', 14.0), ('26/11/1992', 'Priscila', 14.0)]

##**MIN()** - RETORNA O MENOR VALOR DA COLUNA 
##**MAX()** - RETORNA O MAIOR VALOR DA COLUNA

In [ ]:
Consulta = Cursor.execute(
    ''' 
    SELECT MIN (Idade) FROM Minha_Primeira_Tabela
    '''
).fetchall()

print( Consulta )

[(11.0,)]

In [ ]:
Consulta = Cursor.execute(
    ''' 
    SELECT MAX (Idade) FROM Minha_Primeira_Tabela
    '''
).fetchall()

print( Consulta )

[(30.0,)]

##**COUNT ()** - RETORNA O NÚMERO DE LINHAS QUE CORREPONDE A UM CRITÉRIO
##**AVG()** - VALOR MÉDIO DE UMA COLUNA NUMÉRICA
##**SUM()** - SOMA TOTAL DE UMA COLUNA NUMÉRIA

In [ ]:
Consulta = Cursor.execute(
    ''' 
    SELECT COUNT (Idade) FROM Minha_Primeira_Tabela
    '''
).fetchall()

print( Consulta )

[(13,)]

In [ ]:
Consulta = Cursor.execute(
    ''' 
    SELECT AVG (Idade) FROM Minha_Primeira_Tabela
    '''
).fetchall()

print( Consulta )

[(19.23076923076923,)]

In [ ]:
Consulta = Cursor.execute(
    ''' 
    SELECT SUM (Idade) FROM Minha_Primeira_Tabela
    '''
).fetchall()

print( Consulta )

[(250.0,)]

##NOME TEMPORÁRIO A UMA TABELA OU COLUNA **(ALIASES - AS)**
OBS: EXISTE APENAS DURANTE ESSA CONSULTA

In [ ]:
Consulta = Cursor.execute(
    ''' 
    SELECT Idade AS Idade_Clientes FROM Minha_Primeira_Tabela
    '''
).fetchall()

print( Consulta )

[(30.0,), (13.0,), (20.0,), (14.0,), (14.0,), (18.0,), (19.0,), (13.0,), (20.0,), (19.0,), (11.0,), (30.0,), (29.0,)]

##COMBINAR LINHAS DE DUAS OU MAIS TABELAS (COM A CONDIÇÃO DE TER COLUNA RELACIONADA COM AS DUAS OU MAIS TABELAS **(JOIN)**

1. (INNER) JOIN: valores correspondentes em ambas tabelas
2. LEFT (OUTER) JOIN: todos os registros da tabela da esquerda e os registros correspondentes da tabela da direita 
3. RIGHT (OUTER) JOIN: todos os registros da direita e os registros correspondentes da tabela da esquerda
4. FULL (OUTER) JOIN: todos os registros quando há uma correspondência na tabela esquerda ou direita

In [ ]:
# CREATE TABLE - ID e VALOR DA VENDA

Consulta = Cursor.execute(
    '''
    CREATE TABLE Tab_Vendas (id real, valor real)
    '''
)

Conexao.commit()

In [ ]:
# CREATE TABLE - Dados Cadastrais Vendedores
Consulta = Cursor.execute(
    '''
    CREATE TABLE Tab_Cadastro_Vendedor (id real, nome text)
    '''
)

Conexao.commit() ##commit - criando a tabela

In [ ]:
Cursor.execute( 'INSERT INTO Tab_Vendas VALUES (1, 100) ' )
Cursor.execute( 'INSERT INTO Tab_Vendas VALUES (1, 200) ' )
Cursor.execute( 'INSERT INTO Tab_Vendas VALUES (1, 150) ' )

Cursor.execute( 'INSERT INTO Tab_Vendas VALUES (2, 50) ' )
Cursor.execute( 'INSERT INTO Tab_Vendas VALUES (2, 200) ' )
Cursor.execute( 'INSERT INTO Tab_Vendas VALUES (2, 900) ' )

In [ ]:
Cursor.execute( 'INSERT INTO Tab_Cadastro_Vendedor VALUES (1, "Ana Paula Cabral") ' )
Cursor.execute( 'INSERT INTO Tab_Cadastro_Vendedor VALUES (2, "Priscila Cabral") ' )

In [ ]:
#Verificando a tabela

Consulta = Cursor.execute(
    ''' 
    SELECT * FROM Tab_Vendas
    '''
).fetchall()

for Linha in Consulta:
  print( Linha )

(1.0, 100.0)
(1.0, 200.0)
(1.0, 150.0)
(2.0, 50.0)
(2.0, 200.0)
(2.0, 900.0)

In [ ]:
# Verificando a tab
Consulta = Cursor.execute(
    ''' 
    SELECT * FROM Tab_Cadastro_Vendedor
    '''
).fetchall()

for Linha in Consulta:
  print( Linha )

(1.0, 'Ana Paula Cabral')
(2.0, 'Priscila Cabral')

In [ ]:
# INNER JOIN 

Consulta = Cursor.execute(
    ''' 
    SELECT * FROM Tab_Vendas
    INNER JOIN Tab_Cadastro_Vendedor
    ON Tab_Vendas.id = Tab_Cadastro_Vendedor.id
    '''
).fetchall()

for Linha in Consulta:
  print( Linha )

(1.0, 100.0, 1.0, 'Ana Paula Cabral')
(1.0, 200.0, 1.0, 'Ana Paula Cabral')
(1.0, 150.0, 1.0, 'Ana Paula Cabral')
(2.0, 50.0, 2.0, 'Priscila Cabral')
(2.0, 200.0, 2.0, 'Priscila Cabral')
(2.0, 900.0, 2.0, 'Priscila Cabral')

In [ ]:
# LEFT JOIN 
Cursor.execute( 'INSERT INTO Tab_Vendas VALUES (3, 9999) ' )

In [ ]:
Consulta = Cursor.execute(
    ''' 
    SELECT * FROM Tab_Vendas
    LEFT JOIN Tab_Cadastro_Vendedor
    ON Tab_Vendas.id = Tab_Cadastro_Vendedor.id
    '''
).fetchall()

for Linha in Consulta:
  print( Linha )

(1.0, 100.0, 1.0, 'Ana Paula Cabral')
(1.0, 200.0, 1.0, 'Ana Paula Cabral')
(1.0, 150.0, 1.0, 'Ana Paula Cabral')
(2.0, 50.0, 2.0, 'Priscila Cabral')
(2.0, 200.0, 2.0, 'Priscila Cabral')
(2.0, 900.0, 2.0, 'Priscila Cabral')
(3.0, 9999.0, None, None)

## COMBINAR O CONJUNTO DE RSULTADOS DE DUAS OU MAIS SELECT INSTRUÇÕES **(UNION)**

In [ ]:
# CREATE TABLE 
Cursor.execute ('CREATE TABLE Tabela_A (Id real, Nome text)')
Conexao.commit()

Cursor.execute('CREATE TABLE Tabela_B (Id real, Nome text)')
Conexao.commit()

In [ ]:
# Inserir valores
Cursor.execute(' INSERT INTO Tabela_A VALUES ( 1, "David" )')
Cursor.execute(' INSERT INTO Tabela_A VALUES ( 2, "Yohanna" )')
Cursor.execute(' INSERT INTO Tabela_A VALUES ( 3, "Erica" )')

Cursor.execute(' INSERT INTO Tabela_B VALUES ( 1, "Ramon" )')
Cursor.execute(' INSERT INTO Tabela_B VALUES ( 2, "Ju" )')
Cursor.execute(' INSERT INTO Tabela_B VALUES ( 3, "Cadu" )')

In [ ]:
Consulta = Cursor.execute(
    '''
    SELECT * FROM Tabela_A
    '''
).fetchall()
print(Consulta)

[(1.0, 'David'), (2.0, 'Yohanna'), (3.0, 'Erica')]

In [ ]:
Consulta = Cursor.execute(
    '''
    SELECT * FROM Tabela_B
    '''
).fetchall()
print(Consulta)

[(1.0, 'Ramon'), (2.0, 'Ju'), (3.0, 'Cadu')]

In [ ]:
Consulta = Cursor.execute(
    '''
    SELECT * FROM Tabela_A
    UNION ALL
    SELECT * FROM Tabela_B
    '''
).fetchall()

for Linha in Consulta:
  print( Linha )

(1.0, 'David')
(2.0, 'Yohanna')
(3.0, 'Erica')
(1.0, 'Ramon')
(2.0, 'Ju')
(3.0, 'Cadu')

##AGRUPA LINHAS QUE TEM OS MESMOS VALORES EM LINHAS DE RESUMO **(GROUP BY)**

OBS: GROUP BY é frequentemente usada com funções agregadas - COUNT(), MIN(), MAX(), SUM(), AVG().. para agrupar o conjunto de resultados por uma ou mais colunas

In [ ]:
#apenas consultando tabela
Consulta = Cursor.execute(
    '''
    SELECT * FROM Minha_Primeira_Tabela
    '''
).fetchall()

for Linha in Consulta:
  print( Linha )

In [ ]:
Consulta = Cursor.execute(
    '''
    SELECT SUM (Idade) FROM Minha_Primeira_Tabela
    WHERE Nome = 'Ana Paula'
    GROUP BY Nome
    '''
).fetchall()

for Linha in Consulta:
  print( Linha )

In [ ]:
Consulta = Cursor.execute(
    '''
    SELECT COUNT (Idade) FROM Minha_Primeira_Tabela
    GROUP BY Nome
    '''
).fetchall()

for Linha in Consulta:
  print( Linha )

In [ ]:
Consulta = Cursor.execute(
    '''
    SELECT MIN (Idade) FROM Minha_Primeira_Tabela
    GROUP BY Nome
    '''
).fetchall()

for Linha in Consulta:
  print( Linha )

In [ ]:
Consulta = Cursor.execute(
    '''
    SELECT MAX (Idade) FROM Minha_Primeira_Tabela
    GROUP BY Nome
    '''
).fetchall()

for Linha in Consulta:
  print( Linha )

In [ ]:
Consulta = Cursor.execute(
    '''
    SELECT AVG (Idade) FROM Minha_Primeira_Tabela
    GROUP BY Nome
    '''
).fetchall()

for Linha in Consulta:
  print( Linha )

##EXPLICAR SEÇÕES DE INSTRUÇÕES SQL ou IMPEDIR A EXECUÇÃO DE INSTRUÇÕES **(COMMENTS)**

In [ ]:
Consulta = Cursor.execute(
    '''
    -- Selecionado a tabela 
    SELECT * FROM Minha_Primeira_Tabela
    '''
).fetchall()

for Linha in Consulta:
  print( Linha )

## CHAVE PRIMÁRIA **(PRIMARY KEY)** - IDENTIFICA EXCLUSIVAMENTE CADA REGISTRO NA TABELA 

OBS: CHAVES PRIMÁRIAS DEVEM CONTER VALORES UNIQUE e NÃO PODEM CONTER VALORES NULL
OBS: UMA TABELA TEM APENAS UMA CHAVE PRIMÁRIA (PODE SER UMA OU VÁRIAS COLUNAS)

In [ ]:
Query = '''
CREATE TABLE Clientes (
    ID int NOT NULL,
    Nome varchar(255) NOT NULL,
    Sobrenome varchar(255),
    Idade int,
    PRIMARY KEY (ID)
) 
'''

In [ ]:
Consulta = Cursor.execute( Query )

OperationalError: ignored

In [ ]:
#salvar alterações BD

Conexao.commit()

In [ ]:
Cursor.execute("INSERT INTO Clientes VALUES (2, 'Odete', 'Cabral',  85)")

In [ ]:
Cursor.execute( "SELECT * FROM Clientes").fetchall()

[(1, 'Odemir', 'Depieri', 30), (3, 'Odete', 'Cabral', 85)]

In [ ]:
Cursor.execute("INSERT INTO Clientes VALUES (4, 'Ju', 'Simao', 54)")

In [ ]:
Cursor.execute("SELECT * FROM Clientes").fetchall()

[(1, 'Odemir', 'Depieri', 30),
 (3, 'Odete', 'Cabral', 85),
 (2, 'Odete', 'Cabral', 85),
 (4, 'Ju', 'Simao', 54)]

In [ ]:
# A partir daqui eu tento arrumar o resultado desta query, 
#pois Odete apareceu duas vezes. 
#Quero excluir o Odemir e deixar apenas Ju e Odete. 
Consulta = Cursor.execute(
'''
DELETE from Clientes 
WHERE nome = 'Odete'
'''
).fetchall()

In [ ]:
Cursor.execute(
    '''
    SELECT * from Clientes
    '''
).fetchall()

[(1, 'Odemir', 'Depieri', 30), (4, 'Ju', 'Simao', 54)]

In [ ]:
Consulta = Cursor.execute(
'''
DELETE from Clientes 
WHERE nome = 'Odemir' 
'''
).fetchall()

In [ ]:
Consulta = Cursor.execute(
'''
DELETE from Clientes 
WHERE nome = 'Ju'
'''
).fetchall()

In [ ]:
Cursor.execute(
    '''
    SELECT * FROM Clientes
    '''
).fetchall()

[]

In [ ]:
Cursor.execute("INSERT INTO Clientes VALUES (1, 'Odete', 'Cabral',  30)")

In [ ]:
Cursor.execute("INSERT INTO Clientes VALUES (2, 'Ju', 'Cabral',  54)")

In [ ]:
Cursor.execute(
    '''
    SELECT * FROM Clientes
    '''
).fetchall()

[(1, 'Odete', 'Cabral', 30), (2, 'Ju', 'Cabral', 54)]

##CHAVE ESTRANGEIRA É UM CAMPO (OU VÁRIOS CAMPOS) EM UMA TABELA, QUE SE REFERE À PRIMARY KEY EM OUTRA TABELA **(FOREIGN KEY)**

In [ ]:
Query = '''
CREATE TABLE Solicitacoes (
    ID int NOT NULL,
    Numero int NOT NULL,
    IDCliente int,
    PRIMARY KEY (ID),
    FOREIGN KEY (IDCliente) REFERENCES Persons(IDCliente)
)
'''

Consulta = Cursor.execute( Query )

Conexao.commit()

In [ ]:
Cursor.execute("INSERT INTO Solicitacoes VALUES (1, 1000, 1)")

In [ ]:
Cursor.execute("SELECT * FROM Solicitacoes").fetchall()

[(1, 1000, 1)]